org/core.org
#+TITLE: sqrt-data core
#+PROPERTY: header-args:bash         :tangle-mode (identity #o755) :comments link :shebang "#!/usr/bin/env bash"
#+PROPERTY: header-args:python :comments link :eval no
#+PROPERTY: header-args:scheme :comments link :eval no
#+PROPERTY: PRJ-DIR ..

This file contains the core API of the project and things related to the deployement.

* Python CLI
** Common API
This is my preferred way of writing Python modules. The =__init__.py= file imports all the required files with a star import, and those files have the exported entities in the =__all__= variable.

That way I can import things like this: =from sqrt_data.api import settings=.

#+begin_src python :tangle (my/org-prj-dir "sqrt_data/api/__init__.py")
from .config import *
from .db import *
from .hash import *
from .hostname import *
#+end_src

*** Configuration
Let's start with the configuration.

My configuration library of choice for Python is [[https://github.com/rochacbruno/dynaconf][dynaconf]]. I like it because it allows for some simple logic in the config files, e.g. dynamic variables.

#+begin_src python :tangle (my/org-prj-dir "sqrt_data/api/config.py")
import os

from dynaconf import Dynaconf

__all__ = ['settings']

settings_files = [
    # os.path.expanduser('~/.config/sqrt-data/config.toml'),
    'config.toml'
]

if all([not os.path.exists(f) for f in settings_files]):
    print('No config found!')

settings = Dynaconf(settings_files=settings_files)
#+end_src

| Type | Note                                       |
|------+--------------------------------------------|
| TODO | Demarcate this block with links to modules |

#+begin_src conf-toml :tangle (my/org-prj-dir "config.toml")
[database]
user = 'postgres'
password = 'localdbpass'
database = 'data'
host = 'postgres'
port = 5432

[general]
root = '@format {env[HOME]}/logs-sync'
hash_db = '@format {this.general.root}/hash.db'
temp_data_folder = '/tmp/sqrt-data'
cli_log = '@format {env[HOME]}/.local/share/sqrt-data/cli.log'

[sync]
log_file = '@format {this.general.root}/sync.log'
target = 'ssh://pavel@sqrtminusone.xyz//home/pavel/logs-sync'

[archive]
days = 31
timeout = 5

[mpd]
library_csv = '@format {this.general.root}/mpd/mpd_library.csv'
log_folder = '@format {this.general.root}/mpd/logs'

[waka]
api_key = 'dummy'
api_url = 'https://wakatime.com/api/v1'
schema = 'wakatime'

[aw]
last_updated = '@format {this.general.root}/aw_last_updated.json'
logs_folder = '@format {this.general.root}/aw'
android_file = '@format {this.general.root}/android-misc/aw-buckets-export.json'
types = ['afkstatus', 'currentwindow', 'web.tab.current', 'app.editor.activity']
api = 'http://localhost:5600/api'
schema = 'aw'
skip_afk_interval = '900'
skip_afk_apps = '^(zoom|mpv)$'
skip_afk_titles = '^(YouTube)$'
webtab_apps = '^(Nightly|firefox)$'
skip_urls = '^(moz-extension|about:blank)'

[aw.apps_convert]
Nightly = 'firefox'
Chromium-browser = 'Chromium'
unknown = 'Emacs' # EXWM

[google]
android_file = '@format {this.general.root}/google/android-history.json'
android_schema = 'android'

[youtube]
mpv_folder = '@format {this.general.root}/mpv'

[vk]
author = 'Pavel Korytov'
schema = 'vk'

[sleep]
file = '@format {this.general.root}/sleep/sleep-export.csv'
schema = 'sleep'

[sleep.geos]
e3336012 = 'test'

[location]
list_csv = '@format {this.general.root}/csv/locations.csv'
tz_csv = '@format {this.general.root}/csv/loc_timezones.csv'
hostnames_csv = '@format {this.general.root}/csv/loc_hostnames.csv'
#+end_src
*** Database
My favorite Python ORM framework is [[https://www.sqlalchemy.org/][SQLAlchemy]]. I've started this project before the 2.0 version was announced, so some of the usages may reflect the old patterns.

Also, I am using some actual ORM models here, but wherever I can, I trust pandas to manage tables for me.

I have a bunch of options for writing such files:
- if I use noweb, I can't use =M-x org-babel-detangle=
- if I write one huge block, I can't interweave the code with comments
- if I write small blocks, blocks with class methods would have to be indented and I can't use =C-c '=

So I opt for noweb. Fortunately, this seems to be the only class in the entire project, because I adopted it from another project which was designed with an Object-Oriented Paradigm in mind.

This class stores the state in the class variables and all of its methods are static, so really it's nothing more than an aggregation of global variables. Now I'd make it singleton if I were to design this from scratch, but hey, it works.

#+begin_src python :noweb yes :tangle (my/org-prj-dir "sqrt_data/api/db.py")
import logging
from contextlib import contextmanager
from sqlalchemy import create_engine
from sqlalchemy.orm import scoped_session, sessionmaker

from .config import settings

__all__ = ['DBConn']


class DBConn:
    engine = None
    Session = None
    Base = None

    <<db-dbconn>>
#+end_src

A "constructor", which just sets up a bunch of class variables. This has to be called in before any call to the database.
#+begin_src python :noweb-ref db-dbconn :tangle no
def __init__(self, **kwargs):
    DBConn.engine = DBConn.get_engine(**kwargs)
    DBConn.Session = sessionmaker()
    DBConn.Session.configure(bind=self.engine)
    DBConn.scoped_session = scoped_session(DBConn.Session)
    logging.info('Initialized database connection')
#+end_src

A method to reset the class, just in case. The original project used this for unit tests, but I don't plan to implement unit tests here as of now.

#+begin_src python :noweb-ref db-dbconn :tangle no
@classmethod
def reset(cls):
    cls.engine = cls.Session = None
#+end_src

A method to get a database session object. In SQLAlchemy this seems to create transactions in the background, that is you can run =commit()=, =rollback()= and all that good stuff. By default, this commits automatically.
#+begin_src python :noweb-ref db-dbconn :tangle no
@staticmethod
@contextmanager
def get_session(**kwargs):
    session = DBConn.Session(**kwargs)
    yield session
    session.close()
#+end_src

The usage of the above methods is as follows:
#+begin_src python :tangle no
with DBConn.get_session() as db:
    db.<do-stuff>
#+end_src

A similar method, which can be used to ensure that a session exists.
#+begin_src python :noweb-ref db-dbconn :tangle no
@staticmethod
@contextmanager
def ensure_session(session, **kwargs):
    if session is None:
        session = DBConn.Session(**kwargs)
        yield session
        session.close()
    else:
        yield session
#+end_src

A method to get a fresh database engine. This object can be passed to pandas.
#+begin_src python :noweb-ref db-dbconn :tangle no
@staticmethod
def get_engine(user=None, password=None, **kwargs):
    url = "postgresql://{0}:{1}@{2}:{3}/{4}".format(
        user or settings.database.user, password or settings.database.password,
        settings.database.host, settings.database.port,
        settings.database.database
    )
    return create_engine(url, **kwargs)
#+end_src

Finally, a method to create tables in a schema.
#+begin_src python :noweb-ref db-dbconn :tangle no
@staticmethod
def create_schema(schema, Base=None):
    DBConn.engine.execute(f'CREATE SCHEMA IF NOT EXISTS {schema}')
    if Base is not None:
        tables = []
        for name, table in Base.metadata.tables.items():
            if table.schema == schema:
                tables.append(table)
        Base.metadata.create_all(DBConn.engine, tables)
#+end_src
*** Hashes
:PROPERTIES:
:header-args:python+: :tangle (my/org-prj-dir "sqrt_data/api/hash.py")
:END:

Another common thing I need is to track changes within files. The obvious way to do that is to compare hashes of files.
#+begin_src python
from sqlitedict import SqliteDict
import logging
import os
import subprocess
from .config import settings

__all__ = ['md5sum', 'HashDict']
#+end_src

So, first we need to calculate a hash.
#+begin_src python
def md5sum(filename):
    res = subprocess.run(
        ['md5sum', filename],
        capture_output=True,
        check=True,
        cwd=settings.general.root
    ).stdout
    res = res.decode('utf-8')
    return res.split(' ')[0]
#+end_src

Second, how do we store the hashes? I was using a huge JSON file for some time, but during the refactoring, I've come to the idea that something like SQLite would make more sense. [[https://github.com/RaRe-Technologies/sqlitedict][SqliteDict]] seems to be a reasonable wrapper that does exactly what I want, so I'll use that as a base.

Edit <2022-01-08 Sat>: (TODO) I realized that there's little reason to store the hashes in a separate database. I should refactor that to store the hashes in the central database at some point.

One note here is that the module crashes with a message that =libgcc_s.so.1= cannot be found, which seems to be a problem with my Anaconda + Guix setup. [[https://stackoverflow.com/questions/64797838/libgcc-s-so-1-must-be-installed-for-pthread-cancel-to-work][This answer]] on StackOverflow has helped.
#+begin_src python
import ctypes
libgcc_s = ctypes.CDLL('libgcc_s.so.1')
#+end_src

Now, the class:
#+begin_src python
class HashDict(SqliteDict):
    def __init__(self, *args, **kwargs):
        super().__init__(settings.general.hash_db, *args, **kwargs)

    def is_updated(self, filename):
        saved = self.get(filename)
        return saved is None or saved != md5sum(filename)

    def save_hash(self, filename):
        self[filename] = md5sum(filename)

    def toggle_hash(self, filename):
        if self.is_updated(filename):
            self.save_hash(filename)
        else:
            self[filename] = '0'

    def report(self):
        for name, value in self.items():
            if os.path.exists(name):
                if self.is_updated(name):
                    print('[UPD]\t', end='')
                else:
                    print('[   ]\t', end='')
            else:
                print('[DEL]\t', end='')
            print(f"{value}\t{name}")
#+end_src
*** Hostname
We need a way to distinguish between machines on which the app is running. The easiest way to do that is via a hostname, but this doesn't work as expected on Android via termux, so there I have an environment variable set up.

#+begin_src python :tangle (my/org-prj-dir "sqrt_data/api/hostname.py")
import os
import socket

__all__ = ['get_hostname', 'is_android']

def is_android():
    return os.environ.get('ANDROID_PHONE') is not None

def get_hostname():
    return os.environ.get('ANDROID_PHONE', socket.gethostname())
#+end_src
** Cron tasks
Some tasks have to be run on schedule on both server and client. The easiest way to do that seems to be to use [[https://github.com/dbader/schedule][this Python package]].

#+begin_src python :tangle (my/org-prj-dir "sqrt_data/tasks/__init__.py")
from .server import *
from .client import *
#+end_src

*** Server
Tasks to be executed on a server on a regular basis. I'm using subprocesses because it's more stable here.

#+begin_src python :tangle (my/org-prj-dir "sqrt_data/tasks/server.py")
import time
import schedule
import subprocess

__all__ = ['run_server_cron']


def waka_task():
    p = subprocess.run(['sqrt_data', 'waka', 'get-data'])
    if p.returncode != 0:
        return
    subprocess.run(['sqrt_data', 'waka', 'load'])


def mpd_task():
    p = subprocess.run(['sqrt_data', 'mpd', 'load-library'])
    if p.returncode != 0:
        return
    subprocess.run(['sqrt_data', 'mpd', 'load-logs'])


def sleep_task():
    subprocess.run(['sqrt_data', 'sleep', 'load'])


def aw_task():
    p = subprocess.run(['sqrt_data', 'aw', 'load'])
    if p.returncode != 0:
        return
    subprocess.run(['sqrt_data', 'aw', 'postprocessing-dispatch'])


def archive_task():
    p = subprocess.run(['sqrt_data', 'service', 'compress'])
    if p.returncode != 0:
        return


def run_server_cron():
    schedule.every().day.at('00:00').do(waka_task)
    schedule.every().day.at('01:00').do(mpd_task)
    schedule.every().day.at('02:00').do(sleep_task)
    schedule.every().day.at('03:00').do(aw_task)
    schedule.every().day.at('04:00').do(archive_task)

    while True:
        schedule.run_pending()
        time.sleep(1)
#+end_src
*** Client
Client has just one task to sync logs to be executed every hour.

The actual sync happens only once a day, but this approach is an easy way to ensure that the sync will happen. E.g., if at one hour sync failed because there was no internet, it will retry the next hour.

#+begin_src python :tangle (my/org-prj-dir "sqrt_data/tasks/client.py")
import schedule
import time
import logging
from sqrt_data.service import sync_logs

__all__ = ['run_client_cron']


def client_task():
    try:
        sync_logs()
    except Exception:
        logging.exception('Sync error!')


def run_client_cron():
    schedule.every().hour.at(":00").do(client_task)
    while True:
        schedule.run_pending()
        time.sleep(1)
#+end_src
