org/core.org
** CLI entrypoint
:PROPERTIES:
:header-args:python+: :tangle (my/org-prj-dir "sqrt_data/manage.py")
:END:
We need an entrypoint for the CLI. My CLI library of choice is [[https://click.palletsprojects.com/en/8.0.x/][click]].

Also, [[https://github.com/magmax/python-inquirer][python-inquirer]] is a nice library to query the user for something.
#+begin_src python
import logging

import click
import os
import inquirer

from sqrt_data.api import HashDict, settings, get_hostname
from sqrt_data import cli as cli_modules
from sqrt_data import tasks
#+end_src

A simple logging setup.
#+begin_src python
if 'general' in settings:
    if not os.path.exists(os.path.dirname(settings.general.cli_log)):
        os.mkdir(os.path.dirname(settings.general.cli_log))

    logging.basicConfig(
        level=logging.DEBUG,
        format='%(asctime)s %(message)s',
        datefmt='%Y-%m-%d %H:%M:%S',
        handlers=[logging.FileHandler(settings.general.cli_log),
                  logging.StreamHandler()]
    )
else:
    print("Cannot initialize logging without config")
#+end_src

Initialize a click group.
#+begin_src python
@click.group()
def cli():
    print(f'CWD: {os.getcwd()}')
    print(f'hostname: {get_hostname()}')
#+end_src

Add all the components to the group.
#+begin_src python
cli.add_command(cli_modules.waka)
cli.add_command(cli_modules.android)
cli.add_command(cli_modules.vk)
cli.add_command(cli_modules.sleep)
cli.add_command(cli_modules.mpd)
cli.add_command(cli_modules.aw)
cli.add_command(cli_modules.locations)
cli.add_command(cli_modules.service)
cli.add_command(cli_modules.youtube)
#+end_src

The corresponding =__init__.py= in the CLI module:
#+begin_src python :tangle (my/org-prj-dir "sqrt_data/cli/__init__.py")
from .android import *
from .waka import *
from .vk import *
from .sleep import *
from .mpd import *
from .aw import *
from .locations import *
from .service import *
from .youtube import *
#+end_src

Two simple commands to work with file hashes.
#+begin_src python
@click.group(help='Working with hashes')
def hash():
    pass

@hash.command()
def hash_list():
    hashes = HashDict()
    hashes.report()


@hash.command()
@click.option('-n', '--name', required=False, type=str)
def hash_toggle(name):
    with HashDict() as h:
        if name is None:
            name = inquirer.prompt(
                [
                    inquirer.List(
                        'filename', 'Select filename', choices=list(h.keys())
                    )
                ]
            )['filename']  # type: ignore
        h.toggle_hash(os.path.join(settings.general.root, name))
        logging.info('Toggled hash for %s', name)
        h.commit()

cli.add_command(hash)
#+end_src

Also commands to initalize "cron jobs":
#+begin_src python
@click.group(help='Initialize recurring tasks. Meant to be run in a service or such')
def cron():
    pass


@cron.command()
def run_server_cron():
    tasks.run_server_cron()


@cron.command()
def run_client_cron():
    tasks.run_client_cron()


cli.add_command(cron)
#+end_src

Finally, to make this work, we have to invoke =cli()= in case =manage.py= is the main module. That is, when invoked with =python -m sqrt_data.manage=.
#+begin_src python
if __name__ == '__main__':
    cli()
#+end_src

To be able to invoke the app with =python -m sqrt_data=, the following =__main__.py= is necessary:
#+begin_src python :tangle (my/org-prj-dir "sqrt_data/__main__.py")
from .manage import cli

if __name__ == '__main__':
    cli()
#+end_src
* Install
Individual machines have to save the data to the logs folder and propagate new files to the server. Thus, the project has to be installed both on client machines and on the server.

For server installation, check [[*Server deployement][this section]]. For client machines, the installation options are as follows:
- install as a [[*Python][Python package]]
- install as a [[*Guix development setup][Guix package]] from the shipped definition
- install as a Guix package from [[https://github.com/SqrtMinusOne/channel-q][my Guix channel]]

I use the Python package for Android and Guix package for my desktop machines. For Android, also set the =ANDROID_PHONE= environment variable:
#+begin_src bash
export ANDROID_PHONE="orchid"
#+end_src

After installing the package:
- copy =config.toml= to =~/.config/sqrt-data/config.toml=
- run =sqrt_data cron run-client-cron=

** Python setup
To install the package, run:
#+begin_src bash :eval no
pip install .
#+end_src

To install the dependencies, run:
#+begin_src bash :eval no
pip install -r requirements.txt
#+end_src

*** setup.py
#+begin_src python :tangle (my/org-prj-dir "setup.py")
from setuptools import find_packages, setup

setup(
    name='sqrt_data',
    version='2.0.1',
    description=
    'A collection of scripts to gather various data from my machines and store it on my VPS',
    author='SqrtMinusOne',
    author_email='thexcloud@gmail.com',
    packages=find_packages(),
    install_requires=[
        'pandas', 'numpy', 'click', 'inquirer', 'python-mpd2', 'sqlalchemy',
        'psycopg2-binary', 'requests', 'tqdm', 'beautifulsoup4', 'dynaconf',
        'sqlitedict', 'furl', 'schedule', 'tldextract'
    ],
    entry_points='''
    [console_scripts]
    sqrt_data=sqrt_data.manage:cli
    ''')
#+end_src

*** requireiments.txt
#+begin_src text :tangle (my/org-prj-dir "requirements.txt")
pandas
numpy
click
blessed==1.19.0
inquirer
python-mpd2
sqlalchemy
psycopg2-binary
requests
tqdm
beautifulsoup4
dynaconf
sqlitedict
schedule
furl
tldextract
#+end_src
** Guix development setup
This part is largely inspired by the Nyxt build setup.

*** Usage
To make a development environment, run:
#+begin_src bash :eval no
guix shell --container -D -f sqrt-data.scm --share=$HOME/logs-sync
#+end_src
This will create the environment with all the dependencies, but not the =sqrt_data= package itself. =python -m sqrt_data= inside the environment should work.

To create an environment with the package, remove the =-D= flag:
#+begin_src bash :eval no
guix shell --container -f sqrt-data.scm --share=$HOME/logs-sync
#+end_src
Now, just =sqrt_data= should work inside the environment.

One issue with a container is that the app may not have access to stuff outside the container, like the MPD socket. If such access is necessary, remove the =--container= flag.
#+begin_src bash :eval no
guix shell -f sqrt-data.scm
#+end_src

